Revit 2027 API
InsulationMaterial.GetInsulationMaterial Method
 Gets the Conductor Insulation Material data by given Conductor Insulation Material id.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static InsulationMaterial GetInsulationMaterial(
	Document document,
	ElementId insulationMaterialId
)
Public Shared Function GetInsulationMaterial (
	document As Document,
	insulationMaterialId As ElementId
) As InsulationMaterial
public:
static InsulationMaterial^ GetInsulationMaterial(
	Document^ document,
	ElementId^ insulationMaterialId
)
static member GetInsulationMaterial :
        document : Document *
        insulationMaterialId : ElementId -> InsulationMaterial
Parameters
document Document
 The document.
insulationMaterialId ElementId
 The Conductor Insulation Material id.
Return Value
InsulationMaterial
 The Conductor Insulation Material data.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The id is not a Conductor Insulation Material id.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
InsulationMaterial Class
Autodesk.Revit.DB.Electrical Namespace